[
  {
    "title": "I-40 Arkansas River (McClellan-Kerr Nav. Channel) Emergency Bridge Repair & Rehabilitation",
    "client": "Oklahoma Dept. of Transportation",
    "year_built": "2003",
    "role": "Bridge Design Project Manager",
    "responsibilities": "Bridge Design and Details",
    "description": "This project consisted of emergency repair plans to the collapsed I-40 Bridge caused by an errant barge on May 26, 2002. Approximately 600’ of the existing bridge collapsed and shut down I-40 for a couple months. Design and Plans were completed at a very rapid pace in 14 days and resulted in designing the first four (4) spans at the west end. The rapid bridge design and plan production was unheard of at the time and resulted in the bridge design and construction to be completed in record time. The first three (3) spans were designed as prestressed concrete beams and the fourth span as the first span of a three (3) span continuous plate girder span that failed at the connection plates. Rehabilitation plans and construction was later completed to the remaining bridge and reopened to traffic. Protection dolphins were also installed to protect the bridge from future disasters.",
    "challenges": [
      {
        "title": "Multiple Sub-Consultants",
        "description": "The design team consisted of multiple sub-consultants requiring close coordination."
      },
      {
        "title": "ODOT Coordination",
        "description": "ODOT was heavily involved in the day to day progress to help anyway possible and to answer design questions immediately. "
      },
      {
        "title": "Rapid Bridge Design",
        "description": "Deadlines were tight and ODOT pushed harder to complete the design plans before the agreed upon deadline. Incentives were laid out resulting in early completion by 6 days."
      },
      {
        "title": "Employee Challenge",
        "description": "Employee moral was challenged due to long hours."
      }
    ],
    "images": ["proj-1-1.jpg", "proj-1-2.gif", "proj-1-3.gif"]
  },
  {
    "title": "Lindsey Street SPUI  over I-35 in Norman, Oklahoma",
    "client": "Oklahoma Dept. of Transportation",
    "year_built": "2017",
    "role": "Bridge Design Project Manager",
    "responsibilities": "Hydraulic Study at Merkle Creek, Bridge Design and Details, Architectural Design & Details, Retaining Wall Layout & Details, RCB Design & Details at Merkle Creek.",
    "description": "This project consisted of a Single Point Urban Interchange (SPUI) Bridge over I-35 to provide better traffic movements for the City of Norman, especially on game days. A study was completed for a SPUI over vs. SPUI under that consisted of cost differences and advantages and disadvantages to each design. Conceptual plans were provided for discussion. ODOT ultimately determined a SPUI Bridge over I-35 was the best fit. The design consisted of a two (2) span 230’ Prestressed U-Beam design that was wider than a football field at 320’.",
    "challenges": [
      {
        "title": "Expansion/ Contraction",
        "description": "Due to the bridge being wider than it was long, this was a major consideration in that the maximum movement direction was along the width rather than normally along the length."
      },
      {
        "title": "Architectural Enhancements",
        "description": "The architectural features were finalized after the bridge was designed so the design needed to include estimated loads due to the features and checked after the design was approved. The Architectural features were designed and detailed during the construction phase at an accelerated pace."
      },
      {
        "title": "Deck Runoff",
        "description": "Due to the width of the bridge, the design runoff required was larger than what prefabricated drop inlets could provide. The plans provided the design flowrate required and the distribution system. The design and shop drawings of the distribution system and inlets were the responsibility of the contractor."
      },
      {
        "title": "Geometry",
        "description": "Due to varying super-elevations required from the approaching ramps and roadway, spot elevations were determined at specific points along the approach slabs and provided in the construction plans."
      }
    ],
    "images": ["proj-2-1.jpg", "proj-2-2.jpg"]
  },
  {
    "title": "I-40 Crosstown Expressway Relocation Project in Oklahoma City",
    "client": "Oklahoma Department of Transportation",
    "year_built": "2011",
    "role": "Bridge Design Project Manager",
    "responsibilities": "Hydraulic Study, Bridge Design and Details, Architectural Design & Details, Retaining Wall Design & Details, RCB Design & Details, Sub-Consultant Coordination.",
    "description": "This project consisted of multiple bridge locations, retaining walls, screen walls, and u-shaped channels from S. Western to S. Shields Blvd.  The bridge crossings included were at Walker Ave, BNSF Railroad, Robinson Ave., Shields Blvd, Skydance Pedestrian bridge, & multiple reinforced concrete boxes crossing I-40.",
    "challenges": [
      {
        "title": "Multiple Sub-Consultants",
        "description": "The design team consisted of multiple sub-consultants coordinating together to achieve a consistent and successful overall project."
      },
      {
        "title": "Architectural Enhancements",
        "description": "The architectural features were incorporated into the bridge and retaining wall designs and were designed and detailed to achieve the overall theme of the I-40 Crosstown Expressway Realignment project. One retaining wall challenge was accomplished by designing and detailing a candy cane style pylon that could be constructed off site under controlled environment and brought to the site to be hung on the cast-in-place retaining walls at specific intervals. The goal to this design was to not complicate the wall formwork and provide rapid construction methods.  "
      },
      {
        "title": "Hydrology/ Hydraulic Studies",
        "description": "The challenge was to determine the contributing drainage areas and how to transport the runoff through this depressed section of I-40 to the Oklahoma River on the opposite side. The solutions consisted of a network of open u-channel sections running parallel to I-40 and a series of RCB’s at various skew angles coming together at the effluence with the Oklahoma River."
      },
      {
        "title": "Utilization of U-Beam Prestressed Concrete Beams",
        "description": "This was the first utilization of the Prestressed Concrete U-Beam in Oklahoma to achieve longer spans. Several challenges were overcome during the design phase. Some of the challenges were in the design of a bearing device to fit with the wide bottom flange and how to provide access for future inspections to the inside of the beams."
      },
      {
        "title": "Skydance Pedestrian Bridge",
        "description": "The design of this bridge was the final phase for the I-40 Crosstown. The bridge was to be an iconic structure for Oklahoma City and modelled after the State Bird, the Scissor-Tailed Flycatcher. The structure was completed as a prefabricated truss with a timber deck and assembled on site. The substructure was engineered based on the provided loads from the fabrication specialist and rapidly completed."
      }
    ],
    "images": ["proj-3-1.jpg", "proj-3-2.jpg", "proj-3-3.jpg", "proj-3-4.jpg"]
  },
  {
    "title": "Lindsay Street over Imhoff Creek in Norman, Oklahoma",
    "client": "City of Norman",
    "year_built": "2017",
    "role": "Bridge Design Project Manager",
    "responsibilities": "Bridge Substructure Design and Details, Architectural Design & Details, Retaining Wall Layout  & Details",
    "description": "This project consisted of the bridge replacement with a Precast Concrete Arch bridge designed by Contech Engineering Solutions in sections to achieve a 55’ span with a 60’ clear roadway and sidewalks.",
    "challenges": [
      {
        "title": "Multiple Sub-Consultants",
        "description": "The design team consisted of multiple sub-consultants coordinating together to achieve a consistent and successful project."
      },
      {
        "title": "Architectural Enhancements",
        "description": "The architectural features were incorporated into the bridge and retaining wall designs and were designed and detailed with the bridge construction plans to achieve the overall theme."
      },
      {
        "title": "Substructure Design",
        "description": "Design and detailing of the substructure elements were complicated by the architectural elements at the bridge ends. A substructure consisting of an irregular mat slab on steel H-piles was chosen."
      }
    ],
    "images": ["proj-4-1.jpg", "proj-4-2.jpg"]
  },
  {
    "title": "E. Rupe Road over Boggy Creek in Enid, Oklahoma",
    "client": "City of Enid",
    "year_built": "2018",
    "role": "Project Manager",
    "responsibilities": "Bridge Rehabilitation Design and Details, Construction Specifications, Construction Services",
    "description": "This project consisted of bridge rehabilitation plans and specifications to achieve a new deck with an increased clear roadway and new rails. Other bridge deficiencies were addressed as well. Construction services were also an important part of this project and were addressed efficiently and effectively during construction.",
    "images": ["proj-5-1.jpg", "proj-5-2.jpg"]
  },
  {
    "title": "General Obligation Bond (GOB) Replacement of Load Posted Bridges in Enid, Oklahoma",
    "client": "City of Enid",
    "year_built": "2011",
    "role": "Project Manager",
    "responsibilities": "Hydraulic Studies, Bridge Design and Details, Construction Specifications, Construction Services",
    "description": "This program included a number of load posted bridge replacements with completion of hydraulic studies and designs plans with construction specifications.",
    "locations": [
      "E. Chestnut over Skeleton Creek",
      "S. Leona Mitchell over Boggy Creek",
      "E. Market over Skeleton Creek",
      "E. Market over Boggy Creek (Not Constructed Yet)",
      "S. 42nd over Boggy Creek (Not Constructed Yet)",
      "E. Willow over Skeleton Creek"
    ],
    "images": ["proj-6-1.jpg", "proj-6-2.jpg", "proj-6-3.jpg"]
  },
  {
    "title": "E. Reno Ave. over Crooked Oak Creek in Del City, Oklahoma",
    "client": "Oklahoma County",
    "year_built": "2012",
    "role": "Project Manager",
    "responsibilities": "Hydraulic Study, Bridge & Roadway Design and Details, Construction Specifications, Construction Services",
    "description": "This project consisted of the replacement of a structurally deficient bridge with a large three cell Reinforced Concrete Box structure with varying skewed wingwalls to efficiently direct flows. The challenge at this location was how to deal with a large Sanitary Sewer Line at the inlet side that could not be disturbed.",
    "images": ["proj-7-1.jpg"]
  },
  {
    "title": "S.H. 152 Retaining Walls in Binger, Oklahoma",
    "client": "ODOT",
    "year_built": "2019",
    "role": "Retaining Wall Design",
    "responsibilities": "Retaining Wall Design and Details",
    "description": "This project consisted of numerous cast-in-place retaining walls along the improved four lane section of S.H. 152. The challenges were dealing with the rolling terrain and existing utilities along with varying foundation parameters.",
    "images": ["proj-8-1.jpg", "proj-8-2.jpg"]
  },
  {
    "title": "N. Kelly Ave. over Hunter Creek in Edmond, Oklahoma",
    "client": "City of Edmond",
    "year_built": "2015",
    "role": "Bridge Design Project Manager",
    "responsibilities": "Hydraulic Study, Bridge Design and Details, Construction Specifications, Construction Services",
    "description": "This project consisted of a bridge replacement project for four lanes of traffic with sidewalks and a median. A Hydraulic Study was completed in a FEMA Zone AE that determined a bridge length and vertical grade that would produce a zero rise in backwater. Retaining walls were strategically placed on the east side to avoid encroachment to the existing Coffee Creek Golf course. The challenge was to balance the bridge sizing with the vertical grade and overtopping frequency as to not increase the 100-yr. flowrate.",
    "images": ["proj-9-1.jpg", "proj-9-2.jpg"]
  },
  {
    "title": "SH-28 over the Will Rogers Turnpike (I-44) near Adair, Oklahoma",
    "client": "Oklahoma Turnpike Authority",
    "year_built": "2013",
    "role": "Bridge Design Project Manager",
    "responsibilities": "Bridge Design and Details, Construction Specifications, Construction Services",
    "description": "This project consisted of a skewed four (4) span Steel Beam bridge with simple end spans and continuous steel plate girder main spans over the turnpike with length to allow for future expansion to the turnpike below. The challenge was to design and construct the bridge while maintaining traffic on SH-28 and the turnpike below. Coordination with the Dept. of Transportation was required during the design and review process. The challenge was to minimize the grade raise to SH-28 as much as possible.",
    "images": ["proj-10-1.jpg"]
  },
  {
    "title": "I-44 Widening from Arkansas River to S. Lewis Ave. in Tulsa, Oklahoma",
    "client": "Oklahoma Dept. of Transportation",
    "year_built": "2012",
    "role": "Bridge Design Project Manager",
    "responsibilities": "Hydraulic Study for Perryman Ditch, Bridge Design and Details at the Arkansas River, Peoria, Perryman Ditch, Architectural Design & Details, Retaining Wall & Soundwall Design & Details, Perryman Ditch RCB Design & Details.",
    "description": "This project consisted of bridge replacements at S. Peoria, Perryman Ditch, and widening and lengthening of the east end of the Arkansas River Bridge over Riverside.",
    "challenges": [
      {
        "title": "Perryman Ditch Design",
        "description": "The first challenge was to determine the most efficient alignment for the drainage ditch to convey runoff to the Arkansas River effectively and efficiently. Due to the length of the RCB (>1 Mile) the design needed to incorporate periodic access areas from outside and within the cells to provide for maintenance equipment. The outlet was specially designed and detailed to incorporate an existing Sanitary Sewer Line."
      },
      {
        "title": "Architectural Enhancements",
        "description": "The architectural features were incorporated into the bridges and wall designs and were designed and detailed to achieve the overall theme of the I-44 Corridor."
      },
      {
        "title": "Arkansas River Bridge",
        "description": "Due to runout for entrance and exit ramps and modifications to Riverside underneath, the bridge needed to be widened and lengthened on the east end. The challenge was in the geometry and detailing of the variable width deck sections to present a clear and complete set of construction plans.  "
      },
      {
        "title": "Soundwall Design",
        "description": "The soundwall design and detailing was such that the detailing was reduced and could be applied from panel to panel. The challenge was to reduce the number of construction phases to only two to allow faster construction. Instead of constructing columns on top of the drilled shaft foundation system in a separate phase, the design and detailing of the wall incorporated a built-in column within the wall itself."
      }
    ],
    "images": ["proj-11-1.jpg", "proj-11-2.jpg", "proj-11-3.jpg"]
  },
  {
    "title": "SH-10 over Elk River (Grand Lake O’ The Cherokees) near Grove, Oklahoma",
    "client": "Oklahoma Dept. of Transportation",
    "year_built": "2014",
    "role": "Bridge Design Project Manager",
    "responsibilities": "Hydraulic Study, Bridge Design and Details",
    "description": "This project consisted of a bridge replacement with an 850’ Prestressed Concrete Beam bridge with 52’ clear roadway and widened causeway. The challenge with this project was to design and detail the bridge in two phases to minimize the offset distance and to maintain traffic on the existing bridge while under construction.",
    "images": ["proj-12-1.jpg", "proj-12-2.jpg"]
  },
  {
    "title": "ODOT Division 2 Bridge Replacements",
    "client": "Oklahoma Dept. of Transportation",
    "year_built": "2017",
    "role": "Project Manager",
    "responsibilities": "Hydraulic Studies, Bridge Design and Details, Retaining Wall Layout",
    "description": "This contract consisted of four (4) bridge locations with three (3) over the environmentally sensitive waters of the Kiamichi River and one over the Little River and O'flows. Several challenges were overcome with each project consisting of Environmental issues and phased design and construction to keep traffic open.",
    "locations": [
      "US-70 over the Little River & O'flows",
      "US-271 over the Kiamichi River",
      "SH-3 over the Kiamichi River",
      "SH-109 over the Kiamichi River"
    ],
    "images": [
      "proj-13-1.jpg",
      "proj-13-2.jpg",
      "proj-13-3.jpg",
      "proj-13-4.jpg"
    ]
  },
  {
    "title": "East Creek Turnpike Expansions Project near Tulsa, Oklahoma",
    "client": "Oklahoma Turnpike Association",
    "year_built": "2001",
    "role": "Bridge Design Project Manager",
    "responsibilities": "Hydraulic Study, Bridge Design and Details",
    "description": "This contract consisted of 6 bridge locations including the E. Creek T.P./ US412 Interchange. The main challenges were the short timeframe to complete and coordination with ODOT for the US-412 Spunky Hydraulic Study.",
    "locations": [
      "US-412 over Spunky Creek",
      "US-412 Flyover Off-Ramp to E. Creek T.P.",
      "E. Creek T.P. over US-412",
      "E. Admiral Place over E. Creek T.P.",
      "N. 225th E. Ave. over US-412",
      "E. Pine St. over E. Creek T.P."
    ],
    "images": ["proj-14-1.jpg", "proj-14-2.jpg"]
  }
]
