[
  {
    "title": "Bridge Replacement Projects",
    "list": [
      "S.H. 85A over Horse Creek Bridge Replacement, Delaware County, ODOT",
      "Bridge Assessments, City of Bartlesville",
      "N. 52nd W. over Hominy Creek Bridge Replacement, Osage County, ODOT",
      "East Oklahoma City (EOC) Turnpike Bridges at N. Luther Rd., NE 23rd, NE 36th, & NE 50th, OTA",
      "Oklahoma Turnpike Authority Expansion Oversite, Oklahoma, OTA",
      "I-35 Lindsey Street SPUI Bridge Replacement Project, Cleveland Co., ODOT",
      "I-40 Ark. River (McClellan-Kerr Nav. Channel) Emergency Bridge Repair & Rehabilitation, ODOT",
      "I-35/ I-240 Crossroads New Interchange, Oklahoma City, ODOT",
      "I-35 over Oklahoma River Bridge Study, Oklahoma City, ODOT",
      "I-40/ I-44 (K-Interchange) Bridge Study/ Functional Plans, Oklahoma Co., ODOT",
      "I-40 at Meridian, MacArthur, Portland Bridge Study/ Functional Plans, Oklahoma Co., ODOT",
      "SH-28 over Verdigris River Bridge Replacement Project, Nowata Co., ODOT",
      "I-35 at Ladd Road Bridge Replacement, McClain Co., ODOT.",
      "I-35 over US-64 (Fir Street) Bridge Replacement Project, Perry, ODOT",
      "I-35 over AT&SF Railroad Bridge Replacement, Kay Co., ODOT",
      "SH-85 over Duck Creek Bridge Replacement, Delaware Co., ODOT",
      "I-40 Clinton Interchange Study/ Functional Plans, Clinton, ODOT",
      "US-77 over Chouteau Creek Bridge Replacement, Cleveland Co., ODOT",
      "N. Kelly over Hunters Creek, City of Edmond",
      "US-60 over Bois D’ Arc Creek Bridge Replacement, Ponca City, ODOT",
      "I-40 W. Stimulus Bridge Replacement Projects S. of Yukon and El Reno, Canadian Co., ODOT",
      "US-60 over Unnamed Creek, Ottawa Co., ODOT",
      "US-60 over Bull Creek Bridge Replacement, Vinita, ODOT",
      "I-40 over Crutcho Creek and SE 15th Street Bridges & Retaining Walls, Oklahoma Co., ODOT",
      "SH-9 over Little River Bridge Replacement Project, Cleveland Co., ODOT",
      "US-70 over Little River & Overflows Bridge Replacement Project, McCurtain County, ODOT",
      "SH-3 over Kiamichi River Bridge Replacement, Pushmataha Co., ODOT",
      "US-271 over Kiamichi River Bridge Replacement, McIntosh Co., ODOT",
      "SH-109 over Kiamichi River, Choctaw County, ODOT",
      "SH-10 over Grand Lake O’ Cherokees Bridge Replacement, Delaware Co., ODOT",
      "I-44 over Ark. River, Peoria, Perryman Ditch Br. Replacements & Widening, Tulsa Co., ODOT",
      "US-59 over Coal & Red Bank Creek Bridge Functionals, LeFlore Co., ODOT",
      "I-40 Crosstown Expressway Realignment from S. Western to Dallas Interchange Bridges & Retaining Walls including Skydance Pedestrian Bridge Substructure, Oklahoma Co., ODOT.",
      "ODOT Statewide Bridge Redecking & Rehabilitation, ODOT",
      "ODOT Statewide Bridge Hydraulic/ Hydrology Studies, ODOT",
      "General Obligation Bond for 7-Bridge Replacements & 1-Bridge Rehabilitation, City of Enid",
      "US-266 over US-169 Interchange Bridge Replacement Project, Tulsa Co., ODOT",
      "I-35 at S. Shields Boulevard Bridge Project Realignment, Moore, ODOT",
      "US-169 from E. 21st Street to E. Admiral Place Bridges, Tulsa Co., ODOT",
      "S.E. 15th Street Retaining Walls, City of Edmond",
      "I-35 from SE 66th Street to SE 82nd Street Bridge Replacements, Oklahoma County, ODOT",
      "SH-28 over Will Rogers Turnpike (I-44) Bridge Replacement & Study, Mayes Co., OTA/ ODOT",
      "Creek Turnpike Expansion from E. Pine Street to E. 11th Street including US-412 Interchange and US-412 over Spunky Creek, Tulsa Co., OTA/ ODOT ",
      "Turner Turnpike, (I-44) over SH-166 & BNSF R.R. Bridge Replacement & Study, Sapulpa, OTA",
      "US-77 over Red Rock Creek Load Posted Bridge Replacements, Noble Co., ODOT",
      "SH-15 over Red Rock Tributary Load Posted Bridge Replacement, Noble Co., ODOT",
      "Statewide Capital Improvement Program (CIP), ODOT Division 4 ODOT.",
      "I-40 over S.E. 29th Bridge Widening, Oklahoma Co., ODOT CIP",
      "US-177 over Unnamed Creek, Payne Co., ODOT CIP",
      "SH-51 over Little Stillwater Creek, Stillwater, ODOT CIP",
      "SH-33 over Pin Creek, Logan Co., ODOT CIP",
      "SH-152 Retaining Walls, Binger, ODOT",
      "N.E. 23rd over I-35 Bridge Replacement, Oklahoma Co., ODOT CIP",
      "SH-19 over Unnamed Creek, Kiowa Co., ODOT",
      "I-40 over Little Deep Creek & Farmrail R.R. Bridge Replacement Project, Weatherford, ODOT",
      "Britton Road Bridge Replacement, Oklahoma County",
      "Richland Road over Shell Creek Bridge Replacement, Oklahoma City",
      "US-69 over S.H. 9 Bridge Replacement, Eufaula, ODOT",
      "I-35 over US-77 & Rogers Road over I-35 Bridge Replacements, Thackerville, ODOT",
      "US-81 over Killpecker Creek Bridge Replacement, Pond Creek, ODOT",
      "E.K. Gaylord at Bloulevard Retaining Walls, OKC, ODOT",
      "I-35 over SH-32 Bridge Replacement, Marietta, ODOT",
      "County Bridge Inspection Program, ODOT"
    ]
  },
  {
    "title": "Bridge Repair/ Rehabilitation Projects",
    "list": [
      "West Covell Road over Chisholm Creek Emergency Bridge Rehabilitation, City of Edmond",
      "SH-52 over Chisholm Creek and Mill Creek, McIntosh County",
      "I-240 over S. Douglas Boulevard, Cleveland County",
      "I-40 over S. Choctaw Avenue, Canadian County",
      "SH-33 over Lost Creek, Payne County",
      "US-77 over Salt Fork River, Kay County",
      "SH-15 over Red Rock Creek, Noble County",
      "US-64 over Long Branch Creek, Noble County",
      "US-64 over Oak Creek, Noble County",
      "I-44 Belle Isle over Northwest Expressway, OKC",
      "SH-51 Broken Arrow Expressway over Pittsburg Avenue, Tulsa County",
      "SH-3 SD over Clear Boggy Creek, Pontotoc County",
      "US-177 over Salt Creek, Pottawatomie County",
      "SH-33 over Little Deer Creek, Custer County",
      "SH-33 over Dry Creek, Custer County",
      "SH-47 over Big Deer Creek, Custer County",
      "SH-47 over Little Deer Creek, Custer County",
      "US-183 over Glen Creek, Kiowa County",
      "SH-33 over Beaver Creek, Custer County",
      "SH-3E over Little River, Seminole County",
      "US-64 over S. 193rd W. Ave, Tulsa County",
      "US-64 over Shell Creek & N. 161st W. Avenue, Tulsa County",
      "E. 36th Street N. over US-169, Tulsa County",
      "SH-266 over Verdigris River, Rogers County",
      "US-70 over Rock Creek, Bryan County",
      "I-35 over Rush Creek, Garvin County",
      "SH-102 over Captain Creek, Lincoln County",
      "SH-99A over Snake Creek, Seminole County",
      "SH-3 over Mill Creek, Pushmataha Co., ODOT",
      "US-81 over Cimarron River, Kingfisher County",
      "I-244 Ramp N-E over I-244 WB, Tulsa County",
      "I-244 Ramp E-N over I-244 Ramp N-E, Tulsa County",
      "I-244 Ramp N-E over I-244 EB, Tulsa County",
      "Scott Street over I-40, Oklahoma County",
      "SH 74B over Buffalo County, McClain County County",
      "US-81 NB over N. Canadian River, Canadian County"
    ]
  },
  {
    "title": "Bridge Hydraulic Studies",
    "list": [
      "US-60 over Salt Creek, Nowata Co., ODOT",
      "SH-7 over Washita River, Murray Co., ODOT",
      "SH-15 over Unnamed Tributary to Red Rock Creek, Noble Co., ODOT",
      "SH-66 over Pryor Creek, Rogers Co., ODOT",
      "SH-18 over Salt Creek, Payne County",
      "US-64 over Coldwater Creek and Sand Creek, Grant County",
      "US-59 over Unnamed Creek, Craig County",
      "SH-30 over North Fork of the Red River, Beckham County",
      "SH-78 over Yarnaby Creek, Bryan County",
      "SH-51 over West Beaver Creek, Logan County",
      "SH-51 over Middle Beaver Creek, Logan County",
      "SH-33 over Turkey Creek, Roger Mills County",
      "SH-33 over Little Turkey Creek, Roger Mills County",
      "SH-20 over Sycamore Creek, Osage County",
      "Lindsey Street over Merkle Creek, Cleveland County",
      "N. Kelly over Hunters Creek, City of Edmond",
      "SH-15 over Coon Creek, Pontotoc County",
      "US-64 over Unnamed Trib. To Salt Fork of the Arkansas River, Alfalfa County",
      "SH-32 over Wilson Creek, Love County",
      "SH-33 over Caffey Creek, Roger Mills County",
      "SH-33 over Washita River & Overflow, Roger Mills County",
      "SH-33 over Washita River, Roger Mills County",
      "US-177 over Black Bear Creek, Noble County",
      "US-177 over Spring Creek, Noble County"
    ]
  }
]
